{
  "lastSynced": "2026-02-11T21:22:31.430Z",
  "posts": [
    {
      "title": "A new age of design portfolio sites ",
      "slug": "a-new-age-of-design-portfolio-sites",
      "date": "2026-02-10T15:02:55.000Z",
      "excerpt": "I have had my professional website at Fully Operational for almost 15 years. What started as a test to build an HTML website for myself (I failed) turned into a Squarespace site I really only used...",
      "content": "<p>I have had my professional website at <a href=\"https://fully-operational.com/\">Fully Operational</a> for almost 15 years. What started as a test to build an HTML website for myself (I failed) turned into a Squarespace site I really only used when I was in the job market. Thankfully, I have not had to search for too many jobs in that time, but my trusty portfolio site always comes in handy when the time comes. </p><p>Last week, over the course of 2 days, I converted my $190/year Squarespace site into a self-hosted site that will end up costing me about $50 is services up front and $10 per year going forward. I fired up my new friend Cursor, who brought along their friend Claude Code, and asked, &#8220;Build me a portfolio site.&#8221; I gave Cursor my existing site, my LinkedIn URL, a copy of my resume, and 4 inspiration sites to work from. Over the next 3 hours, the site was planned, built, committed to my GitHub repo, deployed onto the correct URL, and the new and improved Fully Operational was born. <br>I did run into some token limits with Cursor, but for $50 a month, I was free and clear. I have already downgraded back to free as we work through some minor tweaks. </p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://travisbsmith.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div><p>This process was incredibly fast and pretty fun, but it was not perfect. I spent about the same amount of time building the initial site as I did troubleshooting why 2 of the homepage images didn&#8217;t load properly. I also had countless iterations where something was committed and deployed, but was, in fact, not. Was it less fustrating that me dusting off my HTML/CSS skills and starting from scratch, yes. Was it a one-shot miracle of technological advancement? No. </p><p>This process gave me something I could actually use and updated my portfolio site, which was much needed. I have tried a handful of other, more complex projects, but they all run out of steam at the 75% mark. </p><p>I am curious what you are all doing with agentic coding help. Send me your coolest projects! </p><p></p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://travisbsmith.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>",
      "link": "https://travisbsmith.substack.com/p/a-new-age-of-design-portfolio-sites",
      "author": "Travis Smith"
    },
    {
      "title": "The double diamond is dead",
      "slug": "the-double-diamond-is-dead",
      "date": "2026-02-03T15:03:33.000Z",
      "excerpt": "For way too long, when designers are asked to show their value, give a case study, or talk about who they are as designers, you get a process diagram, the double diamond, boxes and arrows, a...",
      "content": "<p>For way too long, when designers are asked to show their value, give a case study, or talk about who they are as designers, you get a process diagram, the <a href=\"https://medium.com/design-council/the-double-diamond-15-years-on-8c7bc594610e\">double diamond</a>, boxes and arrows, a workshop, or a lifecycle map. Don&#8217;t get me wrong, I love a diagram, but our reliance on process to prove our value has to stop. These tools each have their place, but they are the how, not the actual value we bring.</p><p>We&#8217;ve spent too much time as a function focusing on the process, and we&#8217;re past that now. <strong>We already are part of the process.</strong> We&#8217;re working on the product. We&#8217;re working with engineering, and we&#8217;re so focused on the perfect process that we&#8217;re forgetting we&#8217;re actually creating impact and doing the work. We&#8217;re solving problems. We&#8217;re acting as if we need a perfect process that delivers perfect results every time, but that&#8217;s not how it works. The process is important, but what&#8217;s more important is how you frame a problem, how you become opinionated about the solution to that problem, and how you execute that solution.</p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://travisbsmith.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div><p>As Designers, we occupy an interesting space, serving as the translation layer between users and the companies we work for. It is an amorphous job, with heightened responsibility and ever-changing levels of autonomy. When customers complain about a flow, it comes to design to &#8220;fix it,&#8221; but the solutions we ship are a combination of an entire team&#8217;s input, and we all need to work together to solve these problems at the right layer, with the right level of detail. Designers should be leading the way. </p><p>When you speak to Engineering, Product, Marketing, Data or the C Suite, they don&#8217;t lead with process. In fact, when Design speaks with other functions and leadership, they often become frustrated with us when we request additional time to validate solutions with users or conduct further research. You are in the conversation for a reason, and you have to be ready to contribute right now. When you talk to Product, they don&#8217;t  automatically jump to discussing its discovery process. They talk about priorities, opportunities, and outcomes. When you talk to Engineering, they don&#8217;t talk about languages, technical architectures, or APIs. They talk about reliability, performance, and speed. Each function has its own process, but when speaking with other functions, they focus on outcomes, not on how they will get there.</p><p><strong>So what do we do now?</strong><br>If you are a designer, you need to stop over-explaining the method and start over-explaining the impact. You need to treat your process as yours and don&#8217;t expect anyone else to buy it. You have to stop justifying your existence and start owning your impact. You are already doing a great job. Just get out of your own way, be opinionated, and be right more than you are wrong. You got this.  </p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://travisbsmith.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>",
      "link": "https://travisbsmith.substack.com/p/the-double-diamond-is-dead",
      "author": "Travis Smith"
    },
    {
      "title": "My current Design stack",
      "slug": "my-current-design-stack",
      "date": "2026-01-27T15:02:48.000Z",
      "excerpt": "My number one design tool is pen and paper. This has been going on for about 20 years, with no clear second place. Specifically, Muji Gel Ink 0.5, Black in a Muji Double Ring Lined Notebook. The only...",
      "content": "<p>My number one design tool is pen and paper. This has been going on for about 20 years, with no clear second place. Specifically, <a href=\"https://www.muji.us/collections/pen-pencils/products/gel-ink-ballpoint-pen-knock-type-black-10-pack-9a63006?_pos=7&amp;_fid=e156d222f&amp;_ss=c\">Muji Gel Ink 0.5, Black</a> in a <a href=\"https://www.muji.us/products/beige-double-ring-lined-notebook?_pos=5&amp;_sid=a5aa59abe&amp;_ss=r\">Muji Double Ring Lined Notebook</a>. The only other acceptable pen is <a href=\"https://fieldnotesbrand.com/products/clic-pen-6-packs\">the Field Notes clic pen</a>.</p><p>Once I have my notes in order, I turn to my handy MacBook Pro and start the tedious task of turning my scribbles into something that other people can understand. I have been playing with <a href=\"https://wisprflow.ai/\">Wispr Flow</a> for dictation, but I am still wary of it&#8217;s consistancy and just type most of the time. I absolutely love <a href=\"https://www.granola.ai/\">Granola</a>, I use it for meetings and also as a dictation assistant. I am still in the grey areas of using an LLM to generate notes from things I say. Does that mean I actually wrote something? I don&#8217;t think so, but it is a helpful step in the process. </p><p><br>I have never been a <a href=\"https://www.figma.com/\">Figma</a> master.  I am just not that kind of designer, but I am fluent enough to work with others in Figma and can get by when needed. I do love a Figjam, but it is not part of my daily design stack. </p><p><br>Over the holiday break, I decided to recreate <a href=\"https://fully-operational.com/\">my personal portfolio site</a> on Squarespace into a self-hosted site. I used <a href=\"https://cursor.com/\">Cursor</a> + <a href=\"https://claude.ai/\">Claude Code</a> + <a href=\"https://github.com/\">Github</a> to recreate my portfolio site, update the overall design, and finally kick the Squarespace annual fee. Cursor + Claude code is pretty incredible, but it did take me twice as long to fix 2 broken images on the site as it did to create the entirely new site&#8230; so there is still a bit to go before the generative tooling is where it claims to be. <br><br>For work, my main design tool is still <a href=\"https://slack.com/\">Slack</a>. If you are in a modern design org, I promise your most impactful design tool is Slack. It is ok to admit it, but you also have to be very careful about the power of an instant question-and-answer machine. <br><br>I am keeping my Stack recommendation on <a href=\"https://beta.gethili.com/collections/d7a7ba00-e7c8-4aab-a4e3-6c4bf8ead122?shared=true&amp;sharer=26fdbe86-c962-4750-9a11-f3992f94bc02\">hili, check it out</a>!<br><br>What is your favorite design tool from 2025? </p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://travisbsmith.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>",
      "link": "https://travisbsmith.substack.com/p/my-current-design-stack",
      "author": "Travis Smith"
    },
    {
      "title": "New year, same me ",
      "slug": "new-year-same-me",
      "date": "2026-01-20T15:03:34.000Z",
      "excerpt": "I spent the last half os 2025 trying to figure out what I was going to do next. I have luckily landed on the Deel design team, but there are a lot of ideas, thoughts, connections, and new things I...",
      "content": "<p>I spent the last half os 2025 trying to figure out what I was going to do next. I have luckily landed on the Deel design team, but there are a lot of ideas, thoughts, connections, and new things I jumped into in 2025, and I want to start sharing them. I am going to dust off this Substack and start posting weekly (I hope). Some posts will be about Design Leadership, others about new design tools I am using, and others about the state of things in the Tech industry. Hopefully, this sounds interesting to you. If not, let me know in the comments. <br><br></p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://travisbsmith.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>",
      "link": "https://travisbsmith.substack.com/p/new-year-same-me",
      "author": "Travis Smith"
    }
  ]
}